reports/benchmark/inspur_MetaX_C550/GLM-5-W8A8/test_05/01/64-1000-i512-o256/bench-test_05-64-1000-i512-o256.log
Skipping import of cpp extensions due to incompatible torch version 2.8.0+metax3.5.3.9 for torchao version 0.15.0             Please see https://github.com/pytorch/ao/issues/2919 for more info
/opt/conda/lib/python3.10/site-packages/torchvision/datapoints/__init__.py:12: UserWarning: The torchvision.datapoints and torchvision.transforms.v2 namespaces are still Beta. While we do not expect major breaking changes, some APIs may still change according to user feedback. Please submit any feedback you may have in this issue: https://github.com/pytorch/vision/issues/6753, and you can also check out https://github.com/pytorch/vision/issues/7319 to learn more about the APIs that we suspect might involve future changes. You can silence this warning by calling torchvision.disable_beta_transforms_warning().
  warnings.warn(_BETA_TRANSFORMS_WARNING)
/opt/conda/lib/python3.10/site-packages/torchvision/transforms/v2/__init__.py:54: UserWarning: The torchvision.datapoints and torchvision.transforms.v2 namespaces are still Beta. While we do not expect major breaking changes, some APIs may still change according to user feedback. Please submit any feedback you may have in this issue: https://github.com/pytorch/vision/issues/6753, and you can also check out https://github.com/pytorch/vision/issues/7319 to learn more about the APIs that we suspect might involve future changes. You can silence this warning by calling torchvision.disable_beta_transforms_warning().
  warnings.warn(_BETA_TRANSFORMS_WARNING)
benchmark_args=Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=8000, dataset_name='random', dataset_path='/home/workspace/ShareGPT_V3_unfiltered_cleaned_split.json', model='/var_docker/data_shared/GLM-5-W8A8', served_model_name=None, tokenizer=None, num_prompts=1000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=512, random_output_len=256, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=64, output_file='reports/benchmark/inspur_MetaX_C550/GLM-5-W8A8/test_05/01/64-1000-i512-o256/bench-test_05-64-1000-i512-o256.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None, rampup_mode=False, ramp_up_period=0.0)
Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=8000, dataset_name='random', dataset_path='/home/workspace/ShareGPT_V3_unfiltered_cleaned_split.json', model='/var_docker/data_shared/GLM-5-W8A8', served_model_name=None, tokenizer=None, num_prompts=1000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=512, random_output_len=256, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=64, output_file='reports/benchmark/inspur_MetaX_C550/GLM-5-W8A8/test_05/01/64-1000-i512-o256/bench-test_05-64-1000-i512-o256.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None, rampup_mode=False, ramp_up_period=0.0)

#Input tokens: 512000
#Output tokens: 256000
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

  0%|          | 0/1000 [00:00<?, ?it/s]
  0%|          | 1/1000 [00:09<2:40:32,  9.64s/it]
  3%|▎         | 28/1000 [00:09<04:00,  4.04it/s] 
  4%|▍         | 44/1000 [00:12<03:34,  4.46it/s]
  5%|▌         | 53/1000 [00:16<04:26,  3.55it/s]
  6%|▌         | 59/1000 [00:18<04:31,  3.46it/s]
  6%|▋         | 63/1000 [00:20<04:38,  3.36it/s]
  7%|▋         | 66/1000 [00:23<06:38,  2.34it/s]
  7%|▋         | 72/1000 [00:23<04:43,  3.28it/s]
  8%|▊         | 76/1000 [00:24<04:14,  3.63it/s]
  8%|▊         | 79/1000 [00:25<04:06,  3.74it/s]
  8%|▊         | 84/1000 [00:25<03:27,  4.40it/s]
  9%|▊         | 86/1000 [00:26<03:27,  4.41it/s]
  9%|▉         | 88/1000 [00:27<04:18,  3.53it/s]
  9%|▉         | 91/1000 [00:28<04:04,  3.72it/s]
  9%|▉         | 92/1000 [00:29<05:19,  2.84it/s]
  9%|▉         | 93/1000 [00:29<05:49,  2.59it/s]
  9%|▉         | 94/1000 [00:29<05:05,  2.96it/s]
 10%|▉         | 96/1000 [00:30<06:35,  2.29it/s]
 10%|█         | 101/1000 [00:31<03:49,  3.91it/s]
 10%|█         | 102/1000 [00:32<04:41,  3.19it/s]
 10%|█         | 105/1000 [00:32<03:51,  3.86it/s]
 11%|█         | 106/1000 [00:33<04:23,  3.40it/s]
 11%|█         | 109/1000 [00:33<04:12,  3.53it/s]
 11%|█         | 110/1000 [00:34<05:08,  2.88it/s]
 11%|█         | 112/1000 [00:35<04:40,  3.17it/s]
 11%|█▏        | 113/1000 [00:35<05:08,  2.88it/s]
 11%|█▏        | 114/1000 [00:36<05:35,  2.64it/s]
 12%|█▏        | 115/1000 [00:36<05:37,  2.63it/s]
 12%|█▏        | 117/1000 [00:37<05:58,  2.46it/s]
 12%|█▏        | 119/1000 [00:38<06:39,  2.20it/s]
 12%|█▏        | 121/1000 [00:38<05:37,  2.61it/s]
 12%|█▏        | 122/1000 [00:40<07:37,  1.92it/s]
 12%|█▏        | 124/1000 [00:40<06:40,  2.19it/s]
 12%|█▎        | 125/1000 [00:41<07:04,  2.06it/s]
 13%|█▎        | 129/1000 [00:42<05:34,  2.60it/s]
 13%|█▎        | 132/1000 [00:43<04:23,  3.29it/s]
 14%|█▎        | 135/1000 [00:43<04:01,  3.59it/s]
 14%|█▍        | 139/1000 [00:44<03:57,  3.63it/s]
 14%|█▍        | 144/1000 [00:45<02:53,  4.93it/s]
 15%|█▍        | 146/1000 [00:45<02:52,  4.95it/s]
 15%|█▍        | 147/1000 [00:46<04:12,  3.37it/s]
 15%|█▍        | 148/1000 [00:47<04:37,  3.07it/s]
 15%|█▌        | 151/1000 [00:47<03:43,  3.80it/s]
 15%|█▌        | 152/1000 [00:48<04:40,  3.02it/s]
 15%|█▌        | 154/1000 [00:49<04:42,  2.99it/s]
 16%|█▌        | 157/1000 [00:49<04:21,  3.23it/s]
 16%|█▌        | 159/1000 [00:50<04:05,  3.42it/s]
 16%|█▌        | 160/1000 [00:51<05:03,  2.77it/s]
 16%|█▌        | 161/1000 [00:51<05:09,  2.71it/s]
 16%|█▋        | 165/1000 [00:52<04:39,  2.99it/s]
 17%|█▋        | 166/1000 [00:53<05:12,  2.67it/s]
 17%|█▋        | 168/1000 [00:53<04:41,  2.96it/s]
 17%|█▋        | 169/1000 [00:54<05:46,  2.40it/s]
 17%|█▋        | 171/1000 [00:55<05:40,  2.44it/s]
 17%|█▋        | 172/1000 [00:56<06:59,  1.98it/s]
 17%|█▋        | 173/1000 [00:56<06:19,  2.18it/s]
 18%|█▊        | 175/1000 [00:57<06:29,  2.12it/s]
 18%|█▊        | 178/1000 [00:58<05:12,  2.63it/s]
 18%|█▊        | 179/1000 [00:59<06:12,  2.20it/s]
 18%|█▊        | 184/1000 [00:59<03:57,  3.43it/s]
 18%|█▊        | 185/1000 [01:00<04:09,  3.27it/s]
 19%|█▉        | 188/1000 [01:01<03:55,  3.44it/s]
 19%|█▉        | 191/1000 [01:01<03:19,  4.06it/s]
 19%|█▉        | 193/1000 [01:02<03:38,  3.69it/s]
 20%|█▉        | 197/1000 [01:03<03:37,  3.69it/s]
 20%|██        | 200/1000 [01:04<03:34,  3.72it/s]
 20%|██        | 201/1000 [01:04<03:47,  3.51it/s]
 20%|██        | 202/1000 [01:04<03:48,  3.50it/s]
 20%|██        | 205/1000 [01:05<03:07,  4.23it/s]
 21%|██        | 207/1000 [01:05<03:09,  4.18it/s]
 21%|██        | 208/1000 [01:06<04:08,  3.19it/s]
 21%|██        | 210/1000 [01:06<03:25,  3.85it/s]
 22%|██▏       | 215/1000 [01:07<02:16,  5.76it/s]
 22%|██▏       | 216/1000 [01:08<03:09,  4.13it/s]
 22%|██▏       | 218/1000 [01:08<02:48,  4.63it/s]
 22%|██▏       | 221/1000 [01:09<03:39,  3.54it/s]
 22%|██▏       | 222/1000 [01:10<04:04,  3.19it/s]
 22%|██▎       | 225/1000 [01:10<03:36,  3.57it/s]
 23%|██▎       | 226/1000 [01:11<04:14,  3.04it/s]
 23%|██▎       | 228/1000 [01:12<05:17,  2.43it/s]
 23%|██▎       | 229/1000 [01:13<05:42,  2.25it/s]
 23%|██▎       | 231/1000 [01:14<06:21,  2.02it/s]
 23%|██▎       | 232/1000 [01:14<06:49,  1.88it/s]
 24%|██▎       | 236/1000 [01:15<04:20,  2.93it/s]
 24%|██▍       | 239/1000 [01:16<03:39,  3.47it/s]
 24%|██▍       | 241/1000 [01:16<03:31,  3.60it/s]
 24%|██▍       | 244/1000 [01:17<04:02,  3.12it/s]
 25%|██▍       | 246/1000 [01:18<03:10,  3.97it/s]
 25%|██▍       | 247/1000 [01:18<04:00,  3.13it/s]
 25%|██▌       | 250/1000 [01:19<03:43,  3.36it/s]
 25%|██▌       | 252/1000 [01:19<03:22,  3.70it/s]
 26%|██▌       | 255/1000 [01:20<03:10,  3.91it/s]
 26%|██▌       | 256/1000 [01:20<03:26,  3.61it/s]
 26%|██▌       | 258/1000 [01:21<04:01,  3.07it/s]
 26%|██▌       | 261/1000 [01:22<03:14,  3.80it/s]
 26%|██▋       | 263/1000 [01:23<03:40,  3.34it/s]
 26%|██▋       | 265/1000 [01:24<04:39,  2.63it/s]
 27%|██▋       | 267/1000 [01:24<04:10,  2.93it/s]
 27%|██▋       | 270/1000 [01:26<04:33,  2.67it/s]
 27%|██▋       | 271/1000 [01:26<04:45,  2.55it/s]
 27%|██▋       | 274/1000 [01:27<03:39,  3.30it/s]
 28%|██▊       | 276/1000 [01:27<03:47,  3.18it/s]
 28%|██▊       | 278/1000 [01:28<04:03,  2.96it/s]
 28%|██▊       | 279/1000 [01:29<04:21,  2.76it/s]
 28%|██▊       | 280/1000 [01:29<04:39,  2.58it/s]
 28%|██▊       | 285/1000 [01:30<02:45,  4.33it/s]
 29%|██▊       | 286/1000 [01:30<03:11,  3.73it/s]
 29%|██▉       | 289/1000 [01:31<02:50,  4.16it/s]
 29%|██▉       | 291/1000 [01:32<03:55,  3.01it/s]
 29%|██▉       | 292/1000 [01:32<04:24,  2.67it/s]
 29%|██▉       | 293/1000 [01:33<04:01,  2.93it/s]
 30%|██▉       | 296/1000 [01:34<03:47,  3.10it/s]
 30%|██▉       | 299/1000 [01:34<02:36,  4.49it/s]
 30%|███       | 300/1000 [01:34<03:27,  3.37it/s]
 30%|███       | 302/1000 [01:35<03:16,  3.55it/s]
 30%|███       | 304/1000 [01:36<04:11,  2.77it/s]
 31%|███       | 309/1000 [01:37<02:56,  3.91it/s]
 31%|███       | 310/1000 [01:37<03:09,  3.65it/s]
 31%|███▏      | 313/1000 [01:38<03:12,  3.57it/s]
 32%|███▏      | 315/1000 [01:39<03:31,  3.23it/s]
 32%|███▏      | 316/1000 [01:40<04:01,  2.83it/s]
 32%|███▏      | 320/1000 [01:40<03:18,  3.42it/s]
 32%|███▏      | 323/1000 [01:41<03:10,  3.55it/s]
 32%|███▏      | 324/1000 [01:42<04:06,  2.75it/s]
 33%|███▎      | 326/1000 [01:43<03:42,  3.03it/s]
 33%|███▎      | 327/1000 [01:43<04:11,  2.68it/s]
 33%|███▎      | 329/1000 [01:44<03:53,  2.87it/s]
 33%|███▎      | 331/1000 [01:44<03:41,  3.02it/s]
 33%|███▎      | 334/1000 [01:45<02:55,  3.79it/s]
 34%|███▎      | 336/1000 [01:45<03:10,  3.49it/s]
 34%|███▎      | 337/1000 [01:46<04:15,  2.60it/s]
 34%|███▍      | 338/1000 [01:47<03:50,  2.87it/s]
 34%|███▍      | 342/1000 [01:48<03:47,  2.89it/s]
 34%|███▍      | 343/1000 [01:49<04:12,  2.60it/s]
 35%|███▍      | 346/1000 [01:50<03:56,  2.76it/s]
 35%|███▍      | 347/1000 [01:50<04:30,  2.41it/s]
 35%|███▌      | 350/1000 [01:51<03:32,  3.06it/s]
 35%|███▌      | 353/1000 [01:51<02:53,  3.73it/s]
 35%|███▌      | 354/1000 [01:52<03:05,  3.49it/s]
 36%|███▌      | 355/1000 [01:52<03:28,  3.09it/s]
 36%|███▌      | 357/1000 [01:53<03:12,  3.34it/s]
 36%|███▌      | 358/1000 [01:53<03:24,  3.14it/s]
 36%|███▌      | 362/1000 [01:54<02:43,  3.90it/s]
 36%|███▋      | 363/1000 [01:55<03:26,  3.08it/s]
 36%|███▋      | 365/1000 [01:55<03:30,  3.02it/s]
 37%|███▋      | 367/1000 [01:56<03:41,  2.86it/s]
 37%|███▋      | 370/1000 [01:57<02:53,  3.62it/s]
 37%|███▋      | 371/1000 [01:57<03:15,  3.22it/s]
 37%|███▋      | 373/1000 [01:58<03:02,  3.44it/s]
 37%|███▋      | 374/1000 [01:58<03:14,  3.22it/s]
 38%|███▊      | 377/1000 [01:59<03:00,  3.45it/s]
 38%|███▊      | 378/1000 [02:00<04:24,  2.35it/s]
 38%|███▊      | 380/1000 [02:01<04:27,  2.32it/s]
 38%|███▊      | 382/1000 [02:01<03:50,  2.69it/s]
 38%|███▊      | 383/1000 [02:02<05:02,  2.04it/s]
 38%|███▊      | 384/1000 [02:03<05:02,  2.04it/s]
 39%|███▊      | 387/1000 [02:03<03:55,  2.61it/s]
 39%|███▉      | 388/1000 [02:04<04:41,  2.17it/s]
 39%|███▉      | 389/1000 [02:04<04:07,  2.47it/s]
 39%|███▉      | 392/1000 [02:05<03:25,  2.97it/s]
 40%|███▉      | 395/1000 [02:06<02:34,  3.91it/s]
 40%|███▉      | 396/1000 [02:07<03:46,  2.66it/s]
 40%|███▉      | 398/1000 [02:07<03:22,  2.98it/s]
 40%|███▉      | 399/1000 [02:08<03:43,  2.69it/s]
 40%|████      | 401/1000 [02:09<03:49,  2.61it/s]
 40%|████      | 402/1000 [02:09<04:47,  2.08it/s]
 41%|████      | 406/1000 [02:10<03:17,  3.00it/s]
 41%|████      | 408/1000 [02:11<04:00,  2.46it/s]
 41%|████      | 411/1000 [02:12<03:07,  3.14it/s]
 41%|████      | 412/1000 [02:12<03:23,  2.90it/s]
 42%|████▏     | 416/1000 [02:13<02:43,  3.57it/s]
 42%|████▏     | 419/1000 [02:14<02:20,  4.12it/s]
 42%|████▏     | 421/1000 [02:14<02:35,  3.72it/s]
 42%|████▏     | 422/1000 [02:15<02:45,  3.49it/s]
 42%|████▏     | 424/1000 [02:16<02:55,  3.28it/s]
 42%|████▎     | 425/1000 [02:16<03:55,  2.44it/s]
 43%|████▎     | 428/1000 [02:17<03:18,  2.88it/s]
 43%|████▎     | 430/1000 [02:18<03:02,  3.12it/s]
 43%|████▎     | 432/1000 [02:18<03:06,  3.04it/s]
 43%|████▎     | 433/1000 [02:20<04:49,  1.96it/s]
 44%|████▎     | 435/1000 [02:20<03:40,  2.56it/s]
 44%|████▍     | 438/1000 [02:21<03:11,  2.93it/s]
 44%|████▍     | 440/1000 [02:22<03:12,  2.92it/s]
 44%|████▍     | 441/1000 [02:23<04:21,  2.13it/s]
 44%|████▍     | 443/1000 [02:23<03:40,  2.52it/s]
 44%|████▍     | 445/1000 [02:24<03:49,  2.42it/s]
 45%|████▍     | 448/1000 [02:24<02:30,  3.66it/s]
 45%|████▍     | 449/1000 [02:25<03:43,  2.47it/s]
 45%|████▌     | 451/1000 [02:26<02:49,  3.24it/s]
 45%|████▌     | 453/1000 [02:27<03:28,  2.62it/s]
 46%|████▌     | 455/1000 [02:27<03:05,  2.94it/s]
 46%|████▌     | 457/1000 [02:27<02:17,  3.96it/s]
 46%|████▌     | 458/1000 [02:28<02:33,  3.52it/s]
 46%|████▌     | 460/1000 [02:28<02:44,  3.28it/s]
 46%|████▌     | 461/1000 [02:29<03:36,  2.49it/s]
 46%|████▌     | 462/1000 [02:30<03:34,  2.51it/s]
 46%|████▋     | 463/1000 [02:30<03:46,  2.37it/s]
 47%|████▋     | 467/1000 [02:31<02:28,  3.59it/s]
 47%|████▋     | 468/1000 [02:31<03:05,  2.87it/s]
 47%|████▋     | 471/1000 [02:32<02:23,  3.68it/s]
 48%|████▊     | 475/1000 [02:33<02:05,  4.19it/s]
 48%|████▊     | 477/1000 [02:33<02:05,  4.16it/s]
 48%|████▊     | 480/1000 [02:34<02:31,  3.44it/s]
 48%|████▊     | 483/1000 [02:35<02:09,  4.00it/s]
 48%|████▊     | 485/1000 [02:36<02:20,  3.67it/s]
 49%|████▊     | 486/1000 [02:36<02:29,  3.43it/s]
 49%|████▊     | 487/1000 [02:36<02:29,  3.43it/s]
 49%|████▉     | 489/1000 [02:36<01:48,  4.71it/s]
 49%|████▉     | 490/1000 [02:37<02:25,  3.51it/s]
 49%|████▉     | 491/1000 [02:37<02:15,  3.76it/s]
 50%|████▉     | 495/1000 [02:38<01:55,  4.37it/s]
 50%|████▉     | 496/1000 [02:39<02:33,  3.28it/s]
 50%|████▉     | 499/1000 [02:39<02:03,  4.06it/s]
 50%|█████     | 503/1000 [02:40<02:19,  3.57it/s]
 51%|█████     | 506/1000 [02:41<02:00,  4.10it/s]
 51%|█████     | 507/1000 [02:41<02:16,  3.61it/s]
 51%|█████     | 512/1000 [02:43<02:10,  3.74it/s]
 52%|█████▏    | 515/1000 [02:43<01:40,  4.81it/s]
 52%|█████▏    | 517/1000 [02:44<02:00,  4.01it/s]
 52%|█████▏    | 519/1000 [02:44<02:16,  3.52it/s]
 52%|█████▏    | 521/1000 [02:46<02:47,  2.86it/s]
 52%|█████▏    | 524/1000 [02:46<02:25,  3.26it/s]
 52%|█████▎    | 525/1000 [02:46<02:17,  3.44it/s]
 53%|█████▎    | 527/1000 [02:47<02:24,  3.27it/s]
 53%|█████▎    | 532/1000 [02:48<02:11,  3.55it/s]
 53%|█████▎    | 534/1000 [02:49<02:12,  3.52it/s]
 54%|█████▎    | 537/1000 [02:50<02:08,  3.60it/s]
 54%|█████▍    | 539/1000 [02:51<02:15,  3.40it/s]
 54%|█████▍    | 542/1000 [02:51<01:54,  3.99it/s]
 54%|█████▍    | 544/1000 [02:52<02:05,  3.64it/s]
 55%|█████▍    | 545/1000 [02:52<02:32,  2.97it/s]
 55%|█████▍    | 547/1000 [02:53<02:00,  3.77it/s]
 55%|█████▍    | 548/1000 [02:54<03:04,  2.44it/s]
 55%|█████▍    | 549/1000 [02:54<03:20,  2.25it/s]
 55%|█████▌    | 550/1000 [02:55<03:04,  2.44it/s]
 55%|█████▌    | 552/1000 [02:55<02:35,  2.89it/s]
 56%|█████▌    | 555/1000 [02:56<02:10,  3.40it/s]
 56%|█████▌    | 558/1000 [02:57<02:33,  2.87it/s]
 56%|█████▌    | 562/1000 [02:58<02:04,  3.52it/s]
 56%|█████▋    | 563/1000 [02:58<02:10,  3.34it/s]
 56%|█████▋    | 564/1000 [02:59<02:24,  3.03it/s]
 57%|█████▋    | 566/1000 [02:59<02:18,  3.14it/s]
 57%|█████▋    | 569/1000 [03:00<02:08,  3.36it/s]
 57%|█████▋    | 571/1000 [03:01<01:55,  3.70it/s]
 57%|█████▋    | 572/1000 [03:01<02:25,  2.93it/s]
 57%|█████▊    | 575/1000 [03:03<02:45,  2.57it/s]
 58%|█████▊    | 576/1000 [03:03<02:38,  2.68it/s]
 58%|█████▊    | 579/1000 [03:03<01:43,  4.07it/s]
 58%|█████▊    | 582/1000 [03:04<01:55,  3.63it/s]
 58%|█████▊    | 584/1000 [03:05<01:51,  3.74it/s]
 58%|█████▊    | 585/1000 [03:05<02:31,  2.74it/s]
 59%|█████▉    | 589/1000 [03:06<01:23,  4.90it/s]
 59%|█████▉    | 591/1000 [03:07<02:13,  3.06it/s]
 59%|█████▉    | 593/1000 [03:07<02:04,  3.27it/s]
 59%|█████▉    | 594/1000 [03:08<02:16,  2.98it/s]
 60%|█████▉    | 598/1000 [03:08<01:15,  5.33it/s]
 60%|██████    | 600/1000 [03:09<01:30,  4.40it/s]
 60%|██████    | 603/1000 [03:10<01:44,  3.80it/s]
 60%|██████    | 604/1000 [03:10<02:08,  3.09it/s]
 61%|██████    | 606/1000 [03:11<02:10,  3.03it/s]
 61%|██████    | 607/1000 [03:12<02:33,  2.55it/s]
 61%|██████    | 609/1000 [03:12<02:14,  2.90it/s]
 61%|██████    | 611/1000 [03:13<02:01,  3.19it/s]
 61%|██████    | 612/1000 [03:13<02:14,  2.89it/s]
 62%|██████▏   | 617/1000 [03:14<01:53,  3.38it/s]
 62%|██████▏   | 619/1000 [03:15<01:34,  4.05it/s]
 62%|██████▏   | 620/1000 [03:15<02:04,  3.04it/s]
 62%|██████▏   | 623/1000 [03:16<01:54,  3.29it/s]
 62%|██████▏   | 624/1000 [03:17<02:16,  2.75it/s]
 63%|██████▎   | 627/1000 [03:18<02:20,  2.66it/s]
 63%|██████▎   | 630/1000 [03:19<01:50,  3.34it/s]
 63%|██████▎   | 632/1000 [03:19<01:45,  3.48it/s]
 63%|██████▎   | 634/1000 [03:20<02:00,  3.04it/s]
 64%|██████▎   | 636/1000 [03:20<01:31,  3.97it/s]
 64%|██████▎   | 637/1000 [03:21<01:57,  3.08it/s]
 64%|██████▍   | 639/1000 [03:22<02:11,  2.75it/s]
 64%|██████▍   | 642/1000 [03:22<01:41,  3.54it/s]
 64%|██████▍   | 643/1000 [03:23<01:41,  3.52it/s]
 65%|██████▍   | 647/1000 [03:23<01:26,  4.10it/s]
 65%|██████▍   | 649/1000 [03:24<01:34,  3.71it/s]
 65%|██████▌   | 651/1000 [03:25<01:36,  3.61it/s]
 65%|██████▌   | 652/1000 [03:25<01:59,  2.92it/s]
 66%|██████▌   | 658/1000 [03:26<01:15,  4.52it/s]
 66%|██████▌   | 659/1000 [03:27<01:34,  3.59it/s]
 66%|██████▌   | 661/1000 [03:28<01:48,  3.11it/s]
 66%|██████▋   | 663/1000 [03:28<01:28,  3.83it/s]
 66%|██████▋   | 664/1000 [03:29<01:56,  2.88it/s]
 67%|██████▋   | 666/1000 [03:29<01:51,  3.01it/s]
 67%|██████▋   | 668/1000 [03:30<01:47,  3.08it/s]
 67%|██████▋   | 669/1000 [03:30<02:03,  2.67it/s]
 67%|██████▋   | 670/1000 [03:31<02:11,  2.52it/s]
 67%|██████▋   | 674/1000 [03:31<01:21,  4.02it/s]
 68%|██████▊   | 675/1000 [03:32<02:00,  2.71it/s]
 68%|██████▊   | 677/1000 [03:33<02:02,  2.64it/s]
 68%|██████▊   | 680/1000 [03:34<01:50,  2.89it/s]
 68%|██████▊   | 683/1000 [03:35<01:40,  3.16it/s]
 68%|██████▊   | 685/1000 [03:36<01:42,  3.07it/s]
 69%|██████▊   | 687/1000 [03:36<01:43,  3.01it/s]
 69%|██████▉   | 691/1000 [03:37<01:24,  3.64it/s]
 69%|██████▉   | 693/1000 [03:39<01:54,  2.67it/s]
 70%|██████▉   | 696/1000 [03:39<01:42,  2.96it/s]
 70%|██████▉   | 697/1000 [03:40<01:49,  2.77it/s]
 70%|██████▉   | 699/1000 [03:41<01:51,  2.71it/s]
 70%|███████   | 702/1000 [03:41<01:27,  3.41it/s]
 70%|███████   | 704/1000 [03:42<01:47,  2.76it/s]
 70%|███████   | 705/1000 [03:43<01:57,  2.50it/s]
 71%|███████   | 707/1000 [03:43<01:29,  3.28it/s]
 71%|███████   | 708/1000 [03:44<01:50,  2.65it/s]
 71%|███████   | 709/1000 [03:44<01:51,  2.62it/s]
 71%|███████   | 712/1000 [03:45<01:30,  3.19it/s]
 71%|███████▏  | 713/1000 [03:45<01:34,  3.05it/s]
 72%|███████▏  | 715/1000 [03:46<01:25,  3.34it/s]
 72%|███████▏  | 718/1000 [03:46<01:12,  3.88it/s]
 72%|███████▏  | 720/1000 [03:48<01:46,  2.62it/s]
 72%|███████▏  | 723/1000 [03:48<01:26,  3.20it/s]
 72%|███████▎  | 725/1000 [03:49<01:21,  3.38it/s]
 73%|███████▎  | 727/1000 [03:49<01:20,  3.38it/s]
 73%|███████▎  | 728/1000 [03:50<01:33,  2.90it/s]
 73%|███████▎  | 731/1000 [03:50<01:13,  3.67it/s]
 73%|███████▎  | 734/1000 [03:52<01:21,  3.26it/s]
 74%|███████▎  | 736/1000 [03:52<01:17,  3.43it/s]
 74%|███████▎  | 737/1000 [03:52<01:21,  3.24it/s]
 74%|███████▍  | 738/1000 [03:53<01:25,  3.07it/s]
 74%|███████▍  | 740/1000 [03:54<01:31,  2.86it/s]
 74%|███████▍  | 742/1000 [03:54<01:21,  3.15it/s]
 74%|███████▍  | 744/1000 [03:54<00:59,  4.31it/s]
 75%|███████▍  | 747/1000 [03:55<00:58,  4.31it/s]
 75%|███████▍  | 748/1000 [03:56<01:17,  3.24it/s]
 75%|███████▌  | 750/1000 [03:57<01:31,  2.72it/s]
 75%|███████▌  | 753/1000 [03:57<01:10,  3.50it/s]
 75%|███████▌  | 754/1000 [03:58<01:22,  2.98it/s]
 76%|███████▌  | 756/1000 [03:58<01:14,  3.25it/s]
 76%|███████▌  | 757/1000 [03:59<01:27,  2.78it/s]
 76%|███████▌  | 759/1000 [03:59<01:21,  2.96it/s]
 76%|███████▌  | 761/1000 [04:00<01:32,  2.57it/s]
 76%|███████▋  | 765/1000 [04:02<01:21,  2.90it/s]
 77%|███████▋  | 768/1000 [04:02<01:13,  3.15it/s]
 77%|███████▋  | 769/1000 [04:03<01:15,  3.04it/s]
 77%|███████▋  | 773/1000 [04:04<01:01,  3.70it/s]
 77%|███████▋  | 774/1000 [04:04<01:14,  3.05it/s]
 78%|███████▊  | 775/1000 [04:05<01:23,  2.69it/s]
 78%|███████▊  | 777/1000 [04:05<01:14,  3.01it/s]
 78%|███████▊  | 779/1000 [04:06<01:17,  2.84it/s]
 78%|███████▊  | 783/1000 [04:07<01:13,  2.96it/s]
 78%|███████▊  | 784/1000 [04:08<01:17,  2.77it/s]
 78%|███████▊  | 785/1000 [04:08<01:15,  2.86it/s]
 79%|███████▊  | 786/1000 [04:09<01:20,  2.64it/s]
 79%|███████▊  | 787/1000 [04:09<01:30,  2.35it/s]
 79%|███████▉  | 789/1000 [04:10<01:15,  2.79it/s]
 79%|███████▉  | 791/1000 [04:10<01:06,  3.13it/s]
 79%|███████▉  | 793/1000 [04:11<01:08,  3.04it/s]
 80%|███████▉  | 797/1000 [04:12<00:56,  3.58it/s]
 80%|████████  | 802/1000 [04:12<00:31,  6.32it/s]
 80%|████████  | 805/1000 [04:13<00:35,  5.44it/s]
 81%|████████  | 807/1000 [04:14<00:58,  3.28it/s]
 81%|████████  | 808/1000 [04:15<01:03,  3.03it/s]
 81%|████████  | 809/1000 [04:15<01:02,  3.08it/s]
 81%|████████  | 811/1000 [04:16<00:56,  3.33it/s]
 81%|████████▏ | 814/1000 [04:16<00:53,  3.47it/s]
 82%|████████▏ | 815/1000 [04:17<01:05,  2.83it/s]
 82%|████████▏ | 816/1000 [04:18<01:20,  2.30it/s]
 82%|████████▏ | 817/1000 [04:18<01:17,  2.35it/s]
 82%|████████▏ | 820/1000 [04:19<01:02,  2.87it/s]
 82%|████████▏ | 821/1000 [04:19<01:03,  2.80it/s]
 82%|████████▏ | 824/1000 [04:21<01:05,  2.67it/s]
 83%|████████▎ | 827/1000 [04:21<00:59,  2.91it/s]
 83%|████████▎ | 831/1000 [04:23<00:52,  3.25it/s]
 83%|████████▎ | 834/1000 [04:23<00:48,  3.40it/s]
 84%|████████▎ | 835/1000 [04:24<00:57,  2.89it/s]
 84%|████████▎ | 836/1000 [04:24<00:55,  2.96it/s]
 84%|████████▎ | 837/1000 [04:25<01:02,  2.61it/s]
 84%|████████▍ | 838/1000 [04:25<00:52,  3.08it/s]
 84%|████████▍ | 839/1000 [04:26<01:20,  2.01it/s]
 84%|████████▍ | 840/1000 [04:26<01:07,  2.36it/s]
 84%|████████▍ | 843/1000 [04:27<00:56,  2.79it/s]
 84%|████████▍ | 845/1000 [04:28<00:50,  3.09it/s]
 85%|████████▍ | 847/1000 [04:28<00:50,  3.03it/s]
 85%|████████▍ | 848/1000 [04:29<00:54,  2.77it/s]
 85%|████████▌ | 850/1000 [04:29<00:40,  3.71it/s]
 85%|████████▌ | 851/1000 [04:29<00:43,  3.40it/s]
 86%|████████▌ | 858/1000 [04:30<00:24,  5.74it/s]
 86%|████████▌ | 860/1000 [04:31<00:29,  4.74it/s]
 86%|████████▋ | 863/1000 [04:31<00:26,  5.09it/s]
 86%|████████▋ | 864/1000 [04:32<00:35,  3.83it/s]
 86%|████████▋ | 865/1000 [04:33<00:46,  2.92it/s]
 87%|████████▋ | 867/1000 [04:33<00:41,  3.20it/s]
 87%|████████▋ | 869/1000 [04:34<00:42,  3.10it/s]
 87%|████████▋ | 870/1000 [04:34<00:43,  2.98it/s]
 87%|████████▋ | 872/1000 [04:35<00:43,  2.95it/s]
 87%|████████▋ | 873/1000 [04:36<00:54,  2.35it/s]
 88%|████████▊ | 875/1000 [04:37<00:56,  2.22it/s]
 88%|████████▊ | 876/1000 [04:37<00:56,  2.18it/s]
 88%|████████▊ | 877/1000 [04:38<00:57,  2.14it/s]
 88%|████████▊ | 879/1000 [04:39<00:48,  2.49it/s]
 88%|████████▊ | 881/1000 [04:39<00:41,  2.89it/s]
 88%|████████▊ | 882/1000 [04:40<00:44,  2.67it/s]
 88%|████████▊ | 884/1000 [04:40<00:38,  3.04it/s]
 89%|████████▊ | 886/1000 [04:41<00:36,  3.16it/s]
 89%|████████▊ | 887/1000 [04:41<00:39,  2.83it/s]
 89%|████████▉ | 891/1000 [04:42<00:29,  3.68it/s]
 89%|████████▉ | 892/1000 [04:43<00:38,  2.82it/s]
 89%|████████▉ | 893/1000 [04:43<00:40,  2.64it/s]
 90%|████████▉ | 895/1000 [04:44<00:40,  2.61it/s]
 90%|████████▉ | 896/1000 [04:45<00:44,  2.36it/s]
 90%|████████▉ | 898/1000 [04:45<00:38,  2.65it/s]
 90%|█████████ | 902/1000 [04:46<00:28,  3.49it/s]
 90%|█████████ | 903/1000 [04:47<00:34,  2.78it/s]
 90%|█████████ | 905/1000 [04:48<00:36,  2.60it/s]
 91%|█████████ | 909/1000 [04:48<00:24,  3.79it/s]
 91%|█████████ | 910/1000 [04:49<00:29,  3.08it/s]
 92%|█████████▏| 915/1000 [04:50<00:20,  4.13it/s]
 92%|█████████▏| 916/1000 [04:50<00:21,  3.83it/s]
 92%|█████████▏| 917/1000 [04:51<00:28,  2.93it/s]
 92%|█████████▏| 918/1000 [04:51<00:25,  3.17it/s]
 92%|█████████▏| 920/1000 [04:52<00:24,  3.23it/s]
 92%|█████████▏| 922/1000 [04:52<00:22,  3.45it/s]
 92%|█████████▏| 923/1000 [04:53<00:29,  2.60it/s]
 92%|█████████▎| 925/1000 [04:53<00:26,  2.82it/s]
 93%|█████████▎| 927/1000 [04:54<00:26,  2.72it/s]
 93%|█████████▎| 928/1000 [04:55<00:26,  2.68it/s]
 93%|█████████▎| 929/1000 [04:55<00:26,  2.64it/s]
 93%|█████████▎| 930/1000 [04:55<00:26,  2.62it/s]
 93%|█████████▎| 933/1000 [04:56<00:21,  3.09it/s]
 94%|█████████▎| 935/1000 [04:57<00:25,  2.53it/s]
 94%|█████████▎| 936/1000 [04:58<00:26,  2.42it/s]
 94%|█████████▍| 938/1000 [04:58<00:24,  2.57it/s]
 94%|█████████▍| 941/1000 [04:59<00:17,  3.41it/s]
 94%|█████████▍| 943/1000 [04:59<00:15,  3.78it/s]
 95%|█████████▍| 947/1000 [05:00<00:10,  5.30it/s]
 95%|█████████▍| 949/1000 [05:00<00:08,  6.01it/s]
 95%|█████████▌| 951/1000 [05:00<00:07,  6.23it/s]
 96%|█████████▌| 955/1000 [05:01<00:05,  8.15it/s]
 96%|█████████▌| 957/1000 [05:01<00:05,  8.60it/s]
 96%|█████████▌| 959/1000 [05:01<00:04,  9.03it/s]
 96%|█████████▌| 960/1000 [05:01<00:05,  6.68it/s]
 97%|█████████▋| 966/1000 [05:01<00:02, 12.19it/s]
 97%|█████████▋| 970/1000 [05:02<00:02, 14.59it/s]
 97%|█████████▋| 972/1000 [05:02<00:02, 12.41it/s]
 98%|█████████▊| 975/1000 [05:02<00:01, 13.59it/s]
 98%|█████████▊| 977/1000 [05:02<00:01, 11.87it/s]
 98%|█████████▊| 979/1000 [05:02<00:01, 12.01it/s]
 98%|█████████▊| 982/1000 [05:03<00:01, 12.21it/s]
 98%|█████████▊| 984/1000 [05:03<00:01, 11.14it/s]
 99%|█████████▊| 987/1000 [05:03<00:00, 13.19it/s]
 99%|█████████▉| 989/1000 [05:03<00:01, 10.83it/s]
 99%|█████████▉| 991/1000 [05:04<00:00,  9.72it/s]
 99%|█████████▉| 993/1000 [05:04<00:00,  7.81it/s]
100%|█████████▉| 996/1000 [05:04<00:00,  9.57it/s]
100%|█████████▉| 999/1000 [05:06<00:00,  4.56it/s]
100%|██████████| 1000/1000 [05:06<00:00,  3.27it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 64        
Successful requests:                     1000      
Benchmark duration (s):                  306.03    
Total input tokens:                      512000    
Total input text tokens:                 512000    
Total generated tokens:                  256000    
Total generated tokens (retokenized):    255604    
Request throughput (req/s):              3.27      
Input token throughput (tok/s):          1673.06   
Output token throughput (tok/s):         836.53    
Peak output token throughput (tok/s):    2426.00   
Peak concurrent requests:                94        
Total token throughput (tok/s):          2509.59   
Concurrency:                             63.18     
Accept length:                           3.81      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   19333.53  
Median E2E Latency (ms):                 18712.97  
P90 E2E Latency (ms):                    25646.09  
P99 E2E Latency (ms):                    30961.28  
---------------Time to First Token----------------
Mean TTFT (ms):                          1213.02   
Median TTFT (ms):                        692.05    
P99 TTFT (ms):                           4391.67   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          71.06     
Median TPOT (ms):                        68.95     
P99 TPOT (ms):                           116.28    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           71.06     
Median ITL (ms):                         25.05     
P95 ITL (ms):                            177.14    
P99 ITL (ms):                            348.28    
Max ITL (ms):                            2482.10   
==================================================